class PostDummyModeling {

  List<String> postProfile = [
    'profile_01.png',
    'profile_02.png',
    'profile_03.png',
    'profile_04.png',
    'profile_05.png',
  ];

  List<String> postName = [
    '함께 분석해봐요',
    '하츄핑 로얄핑',
    '수수수 수퍼노바',
    'thisis멜론머스크',
    '슈카형필립스광고',
  ];

  List<String> postDate =[
    '2024 .10. 02',
    '2024 .10. 03',
    '2024 .10. 04',
    '2024 .10. 05',
    '2024 .10. 06',
  ];

  List<String> postTitle = [
    '2024 10 02 로또 5,000원 샀습니다.',
    '왜 핑이 들어갈까?',
    '윈터 너무 예쁘다 ♥ aespa Winter is so pretty',
    '세계 최고 부자가 일런머스크가 말하는 6가지 성공 비결',
    'He is Not Korean',
  ];

  List<String> postImage = [
    'image_dummy_01.png',
    'image_dummy_02.png',
    'image_dummy_03.png',
    'image_dummy_04.png',
    'image_dummy_05.png',
  ];

  List<String> postContent = [
    '복권을 구매하면 기분이 좋아져서 꾸준히 구매하고 있습니다. 10년을 넘게 퇴근 후 복권을 구매했는데, 급한 업무 일정 때문에 어쩔 수 없이 오전에 복권을 구매하게 되었습니다. 구매 후 번호를 확인해봤는데, 중복된 숫자가 보여서 ‘이래서 당첨되겠나?’라는 생각이 들었습니다. 추첨이 끝나고 며칠 뒤, 연금복권을 확인했는데 1·2등에 당첨되었습니다. 당첨 사실이 믿어지지 않았고, 실감이 나지 않아서인지 기쁨을 느끼지 못했습니다. 오히려 당첨금 수령을 위해 서울로 가는 길이 너무 떨리고 긴장되었습니다. 평소에 노후에 대한 걱정이 많아서 국민연금, 개인연금 등을 철저하게 준비해왔지만 부족함을 느끼고 있었는데, 연금복권 1·2등에 당첨되니 모든 걱정이 사라져서 너무 기쁩니다. 노후를 생각하면 안정적으로 당첨을 받을 수 있는 연금복권에 당첨돼서 감사한 마음입니다.',
    '사랑의 티니핑. 늘 로미와 함께 다니며 애교 넘치는 로열핑으로, 사랑과 배려가 넘치는 성격. 티니핑 중 로미와 가장 친하며, 비밀의 방에 있던 티니핑 봉인이 풀려나 지구로 흩어질 때 로미가 손을 꼭 잡아준 덕분에 유일무이하게 지구로 떨어지지 않고 로미와 함께 처음부터 같이 다녔으며, 모든 티니핑 중 유일무이하게 모든 회차와 시즌에 출연 중이다.',
    '사건은 다가와 Ah Oh Ay,\n거세게 커져가 Ah Oh Ay\nBring the ligth of a dying star\n불러낸 내 우주를 봐 봐\nNova\nSupernova ',
    '돈이 중요한 것이 아니다\n열정을 좇아라\n목표를 크게 가지는 것을 두려워하지 말라\n모험할 준비를 하라\n비판을 무시하라\n즐겨라',
    '단기간에 큰 성과를 내야하는 투자? 그거 엄청 괴롭다. 나도 펀드매니저로 해봤다. 펀드매니저는 그나마 남의 돈 이지만, 여러분은 그러지 않는다 이런걸 좋아서 하는 사람이 어딨냐, 중독자도 아니고 다들 스트레스 받으면서 한다. 사회가 시켜서 한다 어른들은 젊은 사람들이 이렇게 하는거에 미안해야 한다. 이런식의 투자는 괴롭다. 우린 저렇게 투자하지 않지 않았나?',
  ];

}
